# Exploring eBay Car Sales Data

In this guided project, we'll work with a dataset of used cars from eBay Kleinanzeigen, a classifieds section of the German eBay website.

The dataset was originally scraped and uploaded to Kaggle by user orgesleka.
The original dataset isn't available on Kaggle anymore, but you can find it [here](https://data.world/data-society/used-cars-data).

We've made a few modifications from the original dataset:

- We sampled 50,000 data points from the full dataset, to ensure your code runs quickly in our hosted environment
- We dirtied the dataset a bit to more closely resemble what you would expect from a scraped dataset (the version uploaded to Kaggle was cleaned to be easier to work with)

The data dictionary provided with data is as follows:

- `dateCrawled` - When this ad was first crawled. All field-values are taken from this date.
- `name` - Name of the car.
- `seller` - Whether the seller is private or a dealer.
- `offerType` - The type of listing
- `price` - The price on the ad to sell the car.
- `abtest` - Whether the listing is included in an A/B test.
- `vehicleType` - The vehicle Type.
- `yearOfRegistration` - The year in which the car was first registered.
- `gearbox` - The transmission type.
- `powerPS` - The power of the car in PS.
- `model` - The car model name.
- `kilometer` - How many kilometers the car has driven.
- `monthOfRegistration` - The month in which the car was first registered.
- `fuelType` - What type of fuel the car uses.
- `brand` - The brand of the car.
- `notRepairedDamage` - If the car has a damage which is not yet repaired.
- `dateCreated` - The date on which the eBay listing was created.
- `nrOfPictures` - The number of pictures in the ad.
- `postalCode` - The postal code for the location of the vehicle.
- `lastSeenOnline` - When the crawler saw this ad last online.

The aim of this project is to clean the data and analyze the included used car listings. You'll also become familiar with some of the unique benefits jupyter notebook provides for pandas.

Let's start by importing the libraries we need and reading the dataset into pandas.

- Start by writing a paragraph in a markdown cell introducing the project and the dataset.
- Import the pandas and NumPy libraries
- Read the autos.csv CSV file into pandas, and assign it to the variable name autos.
    - Try without specifying any encoding (which will default to UTF-8)
    - If you get an encoding error, try the next two most popular encodings (Latin-1 and Windows-1252) until you are able to read the file without error.
- Create a new cell with just the variable autos and run this cell.
    - A neat feature of jupyter notebook is its ability to render the first few and last few values of any pandas object.
- Use the DataFrame.info() and DataFrame.head() methods to print information about the autos dataframe, as well as the first few rows.
    - Write a markdown cell briefly describing your observations.

In [1]:
import pandas as pd
import numpy as np

In [2]:
autos = pd.read_csv('autos.csv')

In [3]:
autos.head()

,dateCrawled,name,seller,offerType,price,abtest,vehicleType,yearOfRegistration,gearbox,powerPS,model,odometer,monthOfRegistration,fuelType,brand,notRepairedDamage,dateCreated,nrOfPictures,postalCode,lastSeen
0,2016-03-26 17:47:46,Peugeot_807_160_NAVTECH_ON_BOARD,privat,Angebot,"$5,000",control,bus,2004,manuell,158,andere,"150,000km",3,lpg,peugeot,nein,2016-03-26 00:00:00,0,79588,2016-04-06 06:45:54
1,2016-04-04 13:38:56,BMW_740i_4_4_Liter_HAMANN_UMBAU_Mega_Optik,privat,Angebot,"$8,500",control,limousine,1997,automatik,286,7er,"150,000km",6,benzin,bmw,nein,2016-04-04 00:00:00,0,71034,2016-04-06 14:45:08
2,2016-03-26 18:57:24,Volkswagen_Golf_1.6_United,privat,Angebot,"$8,990",test,limousine,2009,manuell,102,golf,"70,000km",7,benzin,volkswagen,nein,2016-03-26 00:00:00,0,35394,2016-04-06 20:15:37
3,2016-03-12 16:58:10,Smart_smart_fortwo_coupe_softouch/F1/Klima/Pan...,privat,Angebot,"$4,350",control,kleinwagen,2007,automatik,71,fortwo,"70,000km",6,benzin,smart,nein,2016-03-12 00:00:00,0,33729,2016-03-15 03:16:28
4,2016-04-01 14:38:50,Ford_Focus_1_6_Benzin_Tï¿½V_neu_ist_sehr_gepfleg...,privat,Angebot,"$1,350",test,kombi,2003,manuell,0,focus,"150,000km",7,benzin,ford,nein,2016-04-01 00:00:00,0,39218,2016-04-01 14:38:50

In [4]:
autos.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 50000 entries, 0 to 49999
Data columns (total 20 columns):
 #   Column               Non-Null Count  Dtype
---  ------               --------------  -----
 0   dateCrawled          50000 non-null  object
 1   name                 50000 non-null  object
 2   seller               50000 non-null  object
 3   offerType            50000 non-null  object
 4   price                50000 non-null  object
 5   abtest               50000 non-null  object
 6   vehicleType          44905 non-null  object
 7   yearOfRegistration   50000 non-null  int64
 8   gearbox              47320 non-null  object
 9   powerPS              50000 non-null  int64
 10  model                47242 non-null  object
 11  odometer             50000 non-null  object
 12  monthOfRegistration  50000 non-null  int64
 13  fuelType             45518 non-null  object
 14  brand                50000 non-null  object
 15  notRepairedDamage    40171 non-null  object
 16  dateCreated          50000 non-null  object
 17  nrOfPictures         50000 non-null  int64
 18  postalCode           50000 non-null  int64
 19  lastSeen             50000 non-null  object
dtypes: int64(5), object(15)
memory usage: 7.6+ MB

From the work we did in the last screen, we can make the following observations:

- The dataset contains 20 columns, most of which are strings.
- Some columns have null values, but none have more than ~20% null values.
- The column names use [camelcase](https://en.wikipedia.org/wiki/Camel_case) instead of Python's preferred [snakecase](https://en.wikipedia.org/wiki/Snake_case), which means we can't just replace spaces with underscores.

Let's convert the column names from camelcase to snakecase and reword some of the column names based on the data dictionary to be more descriptive.

- Use the DataFrame.columns attribute to print an array of the existing column names.
- Copy that array and make the following edits to columns names:
  - yearOfRegistration to registration_year
  - monthOfRegistration to registration_month
  - notRepairedDamage to unrepaired_damage
  - dateCreated to ad_created
  - The rest of the column names from camelcase to snakecase.
- Assign the modified column names back to the DataFrame.columns attribute.
- Use DataFrame.head() to look at the current state of the autos dataframe.
- Write a markdown cell explaining the changes you made and why.

## Making edits to the column names

In [5]:
autos.columns

Index(['dateCrawled', 'name', 'seller', 'offerType', 'price', 'abtest',
       'vehicleType', 'yearOfRegistration', 'gearbox', 'powerPS', 'model',
       'odometer', 'monthOfRegistration', 'fuelType', 'brand',
       'notRepairedDamage', 'dateCreated', 'nrOfPictures', 'postalCode',
       'lastSeen'],
      dtype='object')

In [6]:
autos.columns = ['date_crawled', 'name', 'seller', 'offer_type', 'price', 'abtest',
       'vehicle_type', 'registration_year', 'gearbox', 'power_ps', 'model',
       'odometer', 'registration_month', 'fuel_type', 'brand',
       'unrepaired_damage', 'ad_created', 'nr_of_pictures', 'postal_code',
       'last_seen']

In [7]:
autos.columns

Index(['date_crawled', 'name', 'seller', 'offer_type', 'price', 'abtest',
       'vehicle_type', 'registration_year', 'gearbox', 'power_ps', 'model',
       'odometer', 'registration_month', 'fuel_type', 'brand',
       'unrepaired_damage', 'ad_created', 'nr_of_pictures', 'postal_code',
       'last_seen'],
      dtype='object')

In [8]:
autos.head()

,date_crawled,name,seller,offer_type,price,abtest,vehicle_type,registration_year,gearbox,power_ps,model,odometer,registration_month,fuel_type,brand,unrepaired_damage,ad_created,nr_of_pictures,postal_code,last_seen
0,2016-03-26 17:47:46,Peugeot_807_160_NAVTECH_ON_BOARD,privat,Angebot,"$5,000",control,bus,2004,manuell,158,andere,"150,000km",3,lpg,peugeot,nein,2016-03-26 00:00:00,0,79588,2016-04-06 06:45:54
1,2016-04-04 13:38:56,BMW_740i_4_4_Liter_HAMANN_UMBAU_Mega_Optik,privat,Angebot,"$8,500",control,limousine,1997,automatik,286,7er,"150,000km",6,benzin,bmw,nein,2016-04-04 00:00:00,0,71034,2016-04-06 14:45:08
2,2016-03-26 18:57:24,Volkswagen_Golf_1.6_United,privat,Angebot,"$8,990",test,limousine,2009,manuell,102,golf,"70,000km",7,benzin,volkswagen,nein,2016-03-26 00:00:00,0,35394,2016-04-06 20:15:37
3,2016-03-12 16:58:10,Smart_smart_fortwo_coupe_softouch/F1/Klima/Pan...,privat,Angebot,"$4,350",control,kleinwagen,2007,automatik,71,fortwo,"70,000km",6,benzin,smart,nein,2016-03-12 00:00:00,0,33729,2016-03-15 03:16:28
4,2016-04-01 14:38:50,Ford_Focus_1_6_Benzin_Tï¿½V_neu_ist_sehr_gepfleg...,privat,Angebot,"$1,350",test,kombi,2003,manuell,0,focus,"150,000km",7,benzin,ford,nein,2016-04-01 00:00:00,0,39218,2016-04-01 14:38:50

Now let's do some basic data exploration to determine what other cleaning tasks need to be done. Initially we will look for:

- Text columns where all or almost all values are the same. These can often be dropped as they don't have useful information for analysis.
- Examples of numeric data stored as text which can be cleaned and converted.

The following methods are helpful for exploring the data:

- [DataFrame.describe()](https://pandas.pydata.org/pandas-docs/stable/reference/api/pandas.DataFrame.describe.html) (with include='all' to get both categorical and numeric columns)
- [Series.value_counts()](https://pandas.pydata.org/pandas-docs/stable/reference/api/pandas.Series.value_counts.html) and [Series.head()](https://pandas.pydata.org/pandas-docs/stable/reference/api/pandas.Series.head.html) if any columns need a closer look.

## Data exploration to determine what cleaning tasks need to be done

In [9]:
autos.describe(include='all')

,date_crawled,name,seller,offer_type,price,abtest,vehicle_type,registration_year,gearbox,power_ps,model,odometer,registration_month,fuel_type,brand,unrepaired_damage,ad_created,nr_of_pictures,postal_code,last_seen
count,50000,50000,50000,50000,50000,50000,44905,50000.000000,47320,50000.000000,47242,50000,50000.000000,45518,50000,40171,50000,50000.0,50000.000000,50000
unique,48213,38754,2,2,2357,2,8,NaN,2,NaN,245,13,NaN,7,40,2,76,NaN,NaN,39481
top,2016-03-27 22:55:05,Ford_Fiesta,privat,Angebot,$0,test,limousine,NaN,manuell,NaN,golf,"150,000km",NaN,benzin,volkswagen,nein,2016-04-03 00:00:00,NaN,NaN,2016-04-07 06:17:27
freq,3,78,49999,49999,1421,25756,12859,NaN,36993,NaN,4024,32424,NaN,30107,10687,35232,1946,NaN,NaN,8
mean,NaN,NaN,NaN,NaN,NaN,NaN,NaN,2005.073280,NaN,116.355920,NaN,NaN,5.723360,NaN,NaN,NaN,NaN,0.0,50813.627300,NaN
std,NaN,NaN,NaN,NaN,NaN,NaN,NaN,105.712813,NaN,209.216627,NaN,NaN,3.711984,NaN,NaN,NaN,NaN,0.0,25779.747957,NaN
min,NaN,NaN,NaN,NaN,NaN,NaN,NaN,1000.000000,NaN,0.000000,NaN,NaN,0.000000,NaN,NaN,NaN,NaN,0.0,1067.000000,NaN
25%,NaN,NaN,NaN,NaN,NaN,NaN,NaN,1999.000000,NaN,70.000000,NaN,NaN,3.000000,NaN,NaN,NaN,NaN,0.0,30451.000000,NaN
50%,NaN,NaN,NaN,NaN,NaN,NaN,NaN,2003.000000,NaN,105.000000,NaN,NaN,6.000000,NaN,NaN,NaN,NaN,0.0,49577.000000,NaN
75%,NaN,NaN,NaN,NaN,NaN,NaN,NaN,2008.000000,NaN,150.000000,NaN,NaN,9.000000,NaN,NaN,NaN,NaN,0.0,71540.000000,NaN
max,NaN,NaN,NaN,NaN,NaN,NaN,NaN,9999.000000,NaN,17700.000000,NaN,NaN,12.000000,NaN,NaN,NaN,NaN,0.0,99998.000000,NaN

In [10]:
autos['nr_of_pictures'].value_counts(dropna=False)

0    50000
Name: nr_of_pictures, dtype: int64

In [11]:
autos['nr_of_pictures'].unique()

array([0])

In [12]:
autos['seller'].value_counts(dropna=False)

privat        49999
gewerblich        1
Name: seller, dtype: int64

In [13]:
autos['seller'].unique()

array(['privat', 'gewerblich'], dtype=object)

In [14]:
autos['offer_type'].value_counts(dropna=False)

Angebot    49999
Gesuch         1
Name: offer_type, dtype: int64

In [15]:
autos['offer_type'].unique()

array(['Angebot', 'Gesuch'], dtype=object)

In [16]:
autos.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 50000 entries, 0 to 49999
Data columns (total 20 columns):
 #   Column              Non-Null Count  Dtype
---  ------              --------------  -----
 0   date_crawled        50000 non-null  object
 1   name                50000 non-null  object
 2   seller              50000 non-null  object
 3   offer_type          50000 non-null  object
 4   price               50000 non-null  object
 5   abtest              50000 non-null  object
 6   vehicle_type        44905 non-null  object
 7   registration_year   50000 non-null  int64
 8   gearbox             47320 non-null  object
 9   power_ps            50000 non-null  int64
 10  model               47242 non-null  object
 11  odometer            50000 non-null  object
 12  registration_month  50000 non-null  int64
 13  fuel_type           45518 non-null  object
 14  brand               50000 non-null  object
 15  unrepaired_damage   40171 non-null  object
 16  ad_created          50000 non-null  object
 17  nr_of_pictures      50000 non-null  int64
 18  postal_code         50000 non-null  int64
 19  last_seen           50000 non-null  object
dtypes: int64(5), object(15)
memory usage: 7.6+ MB

In [17]:
autos['power_ps'].value_counts()

0        5500
75       3171
60       2195
150      2046
140      1884
         ...
455         1
1016        1
952         1
696         1
16312       1
Name: power_ps, Length: 448, dtype: int64

In [18]:
autos['power_ps'].unique()

array([  158,   286,   102,    71,     0,   150,    90,   101,    75,
         203,   205,   124,   131,   320,   184,   120,   306,   116,
          54,   110,   204,    60,   218,   140,   193,   122,    86,
          43,    95,   435,    84,   224,    58,    65,    80,   121,
         174,   179,    57,   136,   108,    99,   170,   143,   113,
         177,   163,   385,    63,   200,   151,   106,    85,   109,
         145,   127,   250,   105,    50,   126,   160,   183,    81,
         125,   141,   239,   560,    55,    88,   344,   232,    98,
         135,    45,    73,   129,   103,    64,   436,    53,    68,
         211,   245,   128,   241,   115,   231,   325,   235,   197,
         133,   111,   260,    82,    83,   185,   173,    92,    61,
         190,    74,   100,    44,    76,    70,   147,   225,   107,
          69,   517,   230,   315,     1,   370,   360,   354,   155,
         258,   326,    33,    94,   192,   330,   156,   313,    52,
         130,   180,   117,   275,   114,   256,   299,   207,   104,
         118,    87,   394,   220,   272,   175,   280,   420,   333,
          77,   165,    66,    89,   148,     5,   400,   188,   171,
         247,    59,    26,    67,   138,   387,   265,    40,   367,
         401,   345,    48,   381,   328,   223,    72,   310,  6512,
         382,   146,   169,   182,   408,   210,   132,    10,    78,
         186,    79,   123,   166,    41,   194,  1003,   279,   196,
         139,    11,   176,   340,   300,   284,   264,   226,   209,
         380,  1988,   295,   206,   234,   269,   349,   900,    96,
         525,    47,    37,   409,   350,   144,   355,   152,   292,
         271,   500,   321,   212,   334,    34,  6045,    97,   480,
          18,    91,   240,    62,   164,   277,  1781,  1001,   343,
         154,   178,   222,   201,  1793,   213,   398,   305,   215,
         323,    39,   134,   112,   187,   612,    56,   276,   450,
         268,   287,   476,    46,   290,   119,   329,    15,   282,
         233,   228,   270,   599,   514,    30,   259,   431,   999,
         137,   551,   238,     6,  1779,   507,   142,   199,   610,
         485,   252,   237,   365,   317,   371,   198,   368,   640,
         515,   273,   274,    51,     4,    16,   457,  1016,    42,
         281,   405,   309,     2,   850,   379,   449,   348,  1800,
         208,  3750,   555,    93,  1300,   181,  6226,   189,   219,
         311,  3500,    27,   544,   296,   167,  1998,   168,   579,
         285,    35,    14,   161,  1400,   262,   304,  1090,   487,
         242,   254,  4400,   460,    29,    25,    23,   455,   800,
          19,   454,   153,     9,   559,   162,   202, 14009,   630,
         564,   571,   357,    12,  1055,   195,  1082,  2018,   157,
         521,  1103,   432,   502,  1202,   149,  1056,   396,   227,
         298,   754,   243,   322,   266, 15001,   489,  2729,   375,
        9011,    38,   341,   682,   216,  7511,   356,    24,  1796,
         439,    20,    49,   172,  1986,   441,  1398,   214,   374,
        1780,   253,   510,     3,   678,   347,   600,   530,   191,
         386,  1000,   490,   421,  1367,   415,   430,   404,   950,
         362,   587, 16312,   388,     8,  1011, 17700,  1771,   249,
         407,   236,   318,  1753,   952,   740,   585,  8404,    21,
        5867,   473,   504,   289,  1405,   696,  1704,    32, 15016,
       16011,   337,   923,   799,   442,  1401,   650])

Text columns where all or almost all values are the same. These can often be dropped as they don't have useful information for analysis.
- `nr_of_pictures` looks like it has 0 in the entire column
- `seller` has only 2 values and with one of the values filling 49999 cells out of 500000
- `offer_type` has the same problem as `seller` - only 2 values and with one of the values filling 49999 cells out of 500000

## Drop the `nr_of_pictures`, `seller` and `offer_type` columns

In [19]:
autos.drop(columns=['nr_of_pictures', 'seller', 'offer_type'], inplace=True)

In [20]:
autos.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 50000 entries, 0 to 49999
Data columns (total 17 columns):
 #   Column              Non-Null Count  Dtype
---  ------              --------------  -----
 0   date_crawled        50000 non-null  object
 1   name                50000 non-null  object
 2   price               50000 non-null  object
 3   abtest              50000 non-null  object
 4   vehicle_type        44905 non-null  object
 5   registration_year   50000 non-null  int64
 6   gearbox             47320 non-null  object
 7   power_ps            50000 non-null  int64
 8   model               47242 non-null  object
 9   odometer            50000 non-null  object
 10  registration_month  50000 non-null  int64
 11  fuel_type           45518 non-null  object
 12  brand               50000 non-null  object
 13  unrepaired_damage   40171 non-null  object
 14  ad_created          50000 non-null  object
 15  postal_code         50000 non-null  int64
 16  last_seen           50000 non-null  object
dtypes: int64(4), object(13)
memory usage: 6.5+ MB

Examples of numeric data stored as text which can be cleaned and converted.
- price, odometer as numeric
- unrepaired_damage as 0 or 1  
- date_crawled, ad_created, last_seen as datetime objects

## Exercise
You likely found that the `price` and `odometer` columns are numeric values stored as text. For each column:

- Remove any non-numeric characters.
- Convert the column to a numeric dtype.
- Use `DataFrame.rename()` to rename the column to `odometer_km`.

In [21]:
autos.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 50000 entries, 0 to 49999
Data columns (total 17 columns):
 #   Column              Non-Null Count  Dtype
---  ------              --------------  -----
 0   date_crawled        50000 non-null  object
 1   name                50000 non-null  object
 2   price               50000 non-null  object
 3   abtest              50000 non-null  object
 4   vehicle_type        44905 non-null  object
 5   registration_year   50000 non-null  int64
 6   gearbox             47320 non-null  object
 7   power_ps            50000 non-null  int64
 8   model               47242 non-null  object
 9   odometer            50000 non-null  object
 10  registration_month  50000 non-null  int64
 11  fuel_type           45518 non-null  object
 12  brand               50000 non-null  object
 13  unrepaired_damage   40171 non-null  object
 14  ad_created          50000 non-null  object
 15  postal_code         50000 non-null  int64
 16  last_seen           50000 non-null  object
dtypes: int64(4), object(13)
memory usage: 6.5+ MB

### Remove non-numeric characters from the `price` column

In [22]:
autos['price'] = (autos['price']
                        .str.replace('$', '', regex=False)
                        .str.replace(',', '', regex=False)
                        .astype('int'))

In [23]:
autos['price']

0         5000
1         8500
2         8990
3         4350
4         1350
         ...
49995    24900
49996     1980
49997    13200
49998    22900
49999     1250
Name: price, Length: 50000, dtype: int64

In [24]:
autos.dtypes

date_crawled          object
name                  object
price                  int64
abtest                object
vehicle_type          object
registration_year      int64
gearbox               object
power_ps               int64
model                 object
odometer              object
registration_month     int64
fuel_type             object
brand                 object
unrepaired_damage     object
ad_created            object
postal_code            int64
last_seen             object
dtype: object

### Remove non-numeric characters from the `odometer` column and rename it to `odometer_km`

In [25]:
autos['odometer'].value_counts()

150,000km    32424
125,000km     5170
100,000km     2169
90,000km      1757
80,000km      1436
70,000km      1230
60,000km      1164
50,000km      1027
5,000km        967
40,000km       819
30,000km       789
20,000km       784
10,000km       264
Name: odometer, dtype: int64

In [26]:
autos['odometer'] = (autos['odometer']
                         .str.replace('km', '', regex=False)
                         .str.replace(',', '', regex=False)
                         .astype('int'))

In [27]:
autos.rename(columns={'odometer': 'odometer_km'}, inplace=True)

In [28]:
autos.dtypes

date_crawled          object
name                  object
price                  int64
abtest                object
vehicle_type          object
registration_year      int64
gearbox               object
power_ps               int64
model                 object
odometer_km            int64
registration_month     int64
fuel_type             object
brand                 object
unrepaired_damage     object
ad_created            object
postal_code            int64
last_seen             object
dtype: object

In [29]:
autos['odometer_km'].value_counts()

150000    32424
125000     5170
100000     2169
90000      1757
80000      1436
70000      1230
60000      1164
50000      1027
5000        967
40000       819
30000       789
20000       784
10000       264
Name: odometer_km, dtype: int64

## Learn

From the last screen, we learned that there are a number of text columns where almost all of the values are the same (`seller` and `offer_type`). We also converted the `price` and `odometer columns` to numeric types and renamed `odometer` to `odometer_km`.

Let's continue exploring the data, specifically looking for data that doesn't look right. We'll start by analyzing the `odometer_km` and `price columns`. Here's the steps we'll take:

- Analyze the columns using minimum and maximum values and look for any values that look unrealistically high or low (outliers) that we might want to remove.
- We'll use:
  - `Series.unique().shape` to see how many unique values
  - `Series.describe()` to view min/max/median/mean etc
  - `Series.value_counts()`, with some variations:
    - chained to `.head()` if there are lots of values.
    - Because `Series.value_counts()` returns a series, we can use `Series.sort_index()` with `ascending= True` or `False` to view the highest and lowest values with their counts (can also chain to `head()` here).
  - When removing outliers, we can do `df[(df["col"] >= x ) & (df["col"] <= y )]`, but it's more readable to use `df[df["col"].between(x,y)]`

### Analyzing `odometer_km` column:

In [30]:
# Get the number of unique values
autos['odometer_km'].unique().shape

(13,)

In [31]:
# View min/max/median/mean etc
autos['odometer_km'].describe()

count     50000.000000
mean     125732.700000
std       40042.211706
min        5000.000000
25%      125000.000000
50%      150000.000000
75%      150000.000000
max      150000.000000
Name: odometer_km, dtype: float64

In [32]:
autos['odometer_km'].value_counts()

150000    32424
125000     5170
100000     2169
90000      1757
80000      1436
70000      1230
60000      1164
50000      1027
5000        967
40000       819
30000       789
20000       784
10000       264
Name: odometer_km, dtype: int64

In [33]:
autos['odometer_km'].value_counts(normalize=True)*100

150000    64.848
125000    10.340
100000     4.338
90000      3.514
80000      2.872
70000      2.460
60000      2.328
50000      2.054
5000       1.934
40000      1.638
30000      1.578
20000      1.568
10000      0.528
Name: odometer_km, dtype: float64

### Analysis:
- 78% of cars have mileage over 100,000.

### Analyzing `price` column:

In [34]:
# Get the number of unique values
autos['price'].unique().shape

(2357,)

In [35]:
# View min/max/median/mean etc
autos['price'].describe()

count    5.000000e+04
mean     9.840044e+03
std      4.811044e+05
min      0.000000e+00
25%      1.100000e+03
50%      2.950000e+03
75%      7.200000e+03
max      1.000000e+08
Name: price, dtype: float64

In [36]:
autos['price'].value_counts().sort_index()

0           1421
1            156
2              3
3              1
5              2
            ...
10000000       1
11111111       2
12345678       3
27322222       1
99999999       1
Name: price, Length: 2357, dtype: int64

In [37]:
autos['price'].value_counts(normalize=True)

0        0.02842
500      0.01562
1500     0.01468
2500     0.01286
1000     0.01278
          ...
6770     0.00002
61999    0.00002
20987    0.00002
6578     0.00002
48600    0.00002
Name: price, Length: 2357, dtype: float64

In [38]:
autos['price'].value_counts(normalize=True).sort_index()

0           0.02842
1           0.00312
2           0.00006
3           0.00002
5           0.00004
             ...
10000000    0.00002
11111111    0.00004
12345678    0.00006
27322222    0.00002
99999999    0.00002
Name: price, Length: 2357, dtype: float64

In [39]:
autos['price'].value_counts(normalize=True).sort_index().head(10)

0     0.02842
1     0.00312
2     0.00006
3     0.00002
5     0.00004
8     0.00002
9     0.00002
10    0.00014
11    0.00004
12    0.00006
Name: price, dtype: float64

There are 1,421 cars with a price of \\$0 - this is only 2.8\% of the of the cars. Assuming that all auctions start at at least \\$1, we will remove these rows.

In [40]:
autos['price'].value_counts().sort_index(ascending=False).head(20)

99999999    1
27322222    1
12345678    3
11111111    2
10000000    1
3890000     1
1300000     1
1234566     1
999999      2
999990      1
350000      1
345000      1
299000      1
295000      1
265000      1
259000      1
250000      1
220000      1
198000      1
197000      1
Name: price, dtype: int64

The prices increase smoothly to \\$350,000 and then there is a big jump from \\$350,000 to \\$999,990. Prices above \\$350,000 are probably invalid. We will remove those. 

## Drop rows with prices < 1 and prices > 350000

In [41]:
autos = autos[autos['price'].between(1, 350000)]

In [42]:
autos['price'].describe()

count     48565.000000
mean       5888.935591
std        9059.854754
min           1.000000
25%        1200.000000
50%        3000.000000
75%        7490.000000
max      350000.000000
Name: price, dtype: float64

In [43]:
autos.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 48565 entries, 0 to 49999
Data columns (total 17 columns):
 #   Column              Non-Null Count  Dtype
---  ------              --------------  -----
 0   date_crawled        48565 non-null  object
 1   name                48565 non-null  object
 2   price               48565 non-null  int64
 3   abtest              48565 non-null  object
 4   vehicle_type        43979 non-null  object
 5   registration_year   48565 non-null  int64
 6   gearbox             46222 non-null  object
 7   power_ps            48565 non-null  int64
 8   model               46107 non-null  object
 9   odometer_km         48565 non-null  int64
 10  registration_month  48565 non-null  int64
 11  fuel_type           44535 non-null  object
 12  brand               48565 non-null  object
 13  unrepaired_damage   39464 non-null  object
 14  ad_created          48565 non-null  object
 15  postal_code         48565 non-null  int64
 16  last_seen           48565 non-null  object
dtypes: int64(6), object(11)
memory usage: 6.7+ MB

In [44]:
autos.to_csv('autos_cleaned.csv')

## Learn

Let's now move on to the date columns and understand the date range the data covers.

There are 5 columns that should represent date values. Some of these columns were created by the crawler, some came from the website itself. We can differentiate by referring to the data dictionary:

- `date_crawled`: added by the crawler

- `last_seen`: added by the crawler

- `ad_created`: from the website

- `registration_month`: from the website

- `registration_year`: from the website

Right now, the date_crawled, last_seen, and ad_created columns are all identified as string values by pandas. Because these three columns are represented as strings, we need to convert the data into a numerical representation so we can understand it quantitatively. The other two columns are represented as numeric values, so we can use methods like Series.describe() to understand the distribution without any extra data processing.

Let's first understand how the values in the three string columns are formatted. These columns all represent full timestamp values, like so:

In [45]:
autos[['date_crawled','ad_created' ,'last_seen']][:5]

          date_crawled           ad_created            last_seen
0  2016-03-26 17:47:46  2016-03-26 00:00:00  2016-04-06 06:45:54
1  2016-04-04 13:38:56  2016-04-04 00:00:00  2016-04-06 14:45:08
2  2016-03-26 18:57:24  2016-03-26 00:00:00  2016-04-06 20:15:37
3  2016-03-12 16:58:10  2016-03-12 00:00:00  2016-03-15 03:16:28
4  2016-04-01 14:38:50  2016-04-01 00:00:00  2016-04-01 14:38:50

You'll notice that the first 10 characters represent the day (e.g. 2016-03-12). To understand the date range, we can extract just the date values, use Series.value_counts() to generate a distribution, and then sort by the index.

To select the first 10 characters in each column, we can use `Series.str[:10]`:

In [46]:
autos['date_crawled'].str[:10]

0        2016-03-26
1        2016-04-04
2        2016-03-26
3        2016-03-12
4        2016-04-01
            ...
49995    2016-03-27
49996    2016-03-28
49997    2016-04-02
49998    2016-03-08
49999    2016-03-14
Name: date_crawled, Length: 48565, dtype: object

## Exercise:


- Use the workflow we just described to calculate the distribution of values in the date_crawled, ad_created, and last_seen columns (all string columns) as percentages.
  - To include missing values in the distribution and to use percentages instead of counts, chain the `Series.value_counts(normalize=True, dropna=False`) [method](https://pandas.pydata.org/pandas-docs/stable/reference/api/pandas.Series.value_counts.html).
  - To rank by date in ascending order (earliest to latest), chain the Series.sort_index() method.
  - Write a markdown cell after each column exploration to explain your observations.
- Use Series.describe() to understand the distribution of registration_year.
  - Write a markdown cell explaining your observations.

### Calculate the distribution of the `date_crawled` column

In [47]:
(autos['date_crawled']
         .str[:10]
         .value_counts(normalize=True, dropna=False)
         )

2016-04-03    0.038608
2016-03-20    0.037887
2016-03-21    0.037373
2016-03-12    0.036920
2016-03-14    0.036549
2016-04-04    0.036487
2016-03-07    0.036014
2016-04-02    0.035478
2016-03-28    0.034860
2016-03-19    0.034778
2016-03-15    0.034284
2016-03-29    0.034099
2016-03-30    0.033687
2016-04-01    0.033687
2016-03-08    0.033296
2016-03-09    0.033090
2016-03-22    0.032987
2016-03-11    0.032575
2016-03-23    0.032225
2016-03-26    0.032204
2016-03-10    0.032184
2016-03-31    0.031834
2016-03-17    0.031628
2016-03-25    0.031607
2016-03-27    0.031092
2016-03-16    0.029610
2016-03-24    0.029342
2016-03-05    0.025327
2016-03-13    0.015670
2016-03-06    0.014043
2016-04-05    0.013096
2016-03-18    0.012911
2016-04-06    0.003171
2016-04-07    0.001400
Name: date_crawled, dtype: float64

In [48]:
(autos['date_crawled']
         .str[:10]
         .value_counts(normalize=True, dropna=False)
         .sort_index()
         )

2016-03-05    0.025327
2016-03-06    0.014043
2016-03-07    0.036014
2016-03-08    0.033296
2016-03-09    0.033090
2016-03-10    0.032184
2016-03-11    0.032575
2016-03-12    0.036920
2016-03-13    0.015670
2016-03-14    0.036549
2016-03-15    0.034284
2016-03-16    0.029610
2016-03-17    0.031628
2016-03-18    0.012911
2016-03-19    0.034778
2016-03-20    0.037887
2016-03-21    0.037373
2016-03-22    0.032987
2016-03-23    0.032225
2016-03-24    0.029342
2016-03-25    0.031607
2016-03-26    0.032204
2016-03-27    0.031092
2016-03-28    0.034860
2016-03-29    0.034099
2016-03-30    0.033687
2016-03-31    0.031834
2016-04-01    0.033687
2016-04-02    0.035478
2016-04-03    0.038608
2016-04-04    0.036487
2016-04-05    0.013096
2016-04-06    0.003171
2016-04-07    0.001400
Name: date_crawled, dtype: float64

In [49]:
(autos['date_crawled']
         .str[:10]
         .value_counts(normalize=True, dropna=False)
         .sort_values()
         )

2016-04-07    0.001400
2016-04-06    0.003171
2016-03-18    0.012911
2016-04-05    0.013096
2016-03-06    0.014043
2016-03-13    0.015670
2016-03-05    0.025327
2016-03-24    0.029342
2016-03-16    0.029610
2016-03-27    0.031092
2016-03-25    0.031607
2016-03-17    0.031628
2016-03-31    0.031834
2016-03-10    0.032184
2016-03-26    0.032204
2016-03-23    0.032225
2016-03-11    0.032575
2016-03-22    0.032987
2016-03-09    0.033090
2016-03-08    0.033296
2016-04-01    0.033687
2016-03-30    0.033687
2016-03-29    0.034099
2016-03-15    0.034284
2016-03-19    0.034778
2016-03-28    0.034860
2016-04-02    0.035478
2016-03-07    0.036014
2016-04-04    0.036487
2016-03-14    0.036549
2016-03-12    0.036920
2016-03-21    0.037373
2016-03-20    0.037887
2016-04-03    0.038608
Name: date_crawled, dtype: float64

Looks like the site was crawled daily over roughly a one month period in March and April 2016. The distribution of listings crawled on each day is roughly uniform.

### Calculate the distribution of the `ad_created` column

In [50]:
(autos['ad_created']
        .str[:10]
        .value_counts(normalize=True, dropna=False)
        )

2016-04-03    0.038855
2016-03-20    0.037949
2016-03-21    0.037579
2016-04-04    0.036858
2016-03-12    0.036755
                ...
2016-02-07    0.000021
2015-08-10    0.000021
2015-09-09    0.000021
2016-01-13    0.000021
2016-01-03    0.000021
Name: ad_created, Length: 76, dtype: float64

In [51]:
(autos['ad_created']
        .str[:10]
        .value_counts(normalize=True, dropna=False)
        .sort_index()
        )

2015-06-11    0.000021
2015-08-10    0.000021
2015-09-09    0.000021
2015-11-10    0.000021
2015-12-05    0.000021
                ...
2016-04-03    0.038855
2016-04-04    0.036858
2016-04-05    0.011819
2016-04-06    0.003253
2016-04-07    0.001256
Name: ad_created, Length: 76, dtype: float64

There is a large variety of ad created dates. Most fall within 1-2 months of the listing date, but a few are quite old, with the oldest at around 9 months.

### Calculate the distribution of the `last_seen` column

In [52]:
(autos['last_seen']
        .str[:10]
        .value_counts(normalize=True, dropna=False)
        )

2016-04-06    0.221806
2016-04-07    0.131947
2016-04-05    0.124761
2016-03-17    0.028086
2016-04-03    0.025203
2016-04-02    0.024915
2016-03-30    0.024771
2016-04-04    0.024483
2016-03-31    0.023783
2016-03-12    0.023783
2016-04-01    0.022794
2016-03-29    0.022341
2016-03-22    0.021373
2016-03-28    0.020859
2016-03-20    0.020653
2016-03-21    0.020632
2016-03-24    0.019767
2016-03-25    0.019211
2016-03-23    0.018532
2016-03-26    0.016802
2016-03-16    0.016452
2016-03-15    0.015876
2016-03-19    0.015834
2016-03-27    0.015649
2016-03-14    0.012602
2016-03-11    0.012375
2016-03-10    0.010666
2016-03-09    0.009595
2016-03-13    0.008895
2016-03-08    0.007413
2016-03-18    0.007351
2016-03-07    0.005395
2016-03-06    0.004324
2016-03-05    0.001071
Name: last_seen, dtype: float64

In [53]:
(autos['last_seen']
        .str[:10]
        .value_counts(normalize=True, dropna=False)
        .sort_index()
        )

2016-03-05    0.001071
2016-03-06    0.004324
2016-03-07    0.005395
2016-03-08    0.007413
2016-03-09    0.009595
2016-03-10    0.010666
2016-03-11    0.012375
2016-03-12    0.023783
2016-03-13    0.008895
2016-03-14    0.012602
2016-03-15    0.015876
2016-03-16    0.016452
2016-03-17    0.028086
2016-03-18    0.007351
2016-03-19    0.015834
2016-03-20    0.020653
2016-03-21    0.020632
2016-03-22    0.021373
2016-03-23    0.018532
2016-03-24    0.019767
2016-03-25    0.019211
2016-03-26    0.016802
2016-03-27    0.015649
2016-03-28    0.020859
2016-03-29    0.022341
2016-03-30    0.024771
2016-03-31    0.023783
2016-04-01    0.022794
2016-04-02    0.024915
2016-04-03    0.025203
2016-04-04    0.024483
2016-04-05    0.124761
2016-04-06    0.221806
2016-04-07    0.131947
Name: last_seen, dtype: float64

The crawler recorded the date it last saw any listing, which allows us to determine on what day a listing was removed, presumably because the car was sold.

The last three days contain a disproportionate amount of 'last seen' values. Given that these are 6-10x the values from the previous days, it's unlikely that there was a massive spike in sales, and more likely that these values are to do with the crawling period ending and don't indicate car sales.

### Calculate the distribution of the `registration_year` column

In [54]:
autos['registration_year'].describe()

count    48565.000000
mean      2004.755421
std         88.643887
min       1000.000000
25%       1999.000000
50%       2004.000000
75%       2008.000000
max       9999.000000
Name: registration_year, dtype: float64

In [55]:
autos['registration_year'].value_counts(normalize=True, dropna=False)

2000    0.064985
2005    0.060455
1999    0.059652
2004    0.055657
2003    0.055575
          ...
4500    0.000021
4100    0.000021
1939    0.000021
5911    0.000021
1952    0.000021
Name: registration_year, Length: 95, dtype: float64

In [56]:
(autos['registration_year']
         .value_counts(normalize=True, dropna=False)
         .sort_index()
         .head(45)
         )

1000    0.000021
1001    0.000021
1111    0.000021
1800    0.000041
1910    0.000103
1927    0.000021
1929    0.000021
1931    0.000021
1934    0.000041
1937    0.000082
1938    0.000021
1939    0.000021
1941    0.000041
1943    0.000021
1948    0.000021
1950    0.000062
1951    0.000041
1952    0.000021
1953    0.000021
1954    0.000041
1955    0.000041
1956    0.000082
1957    0.000041
1958    0.000082
1959    0.000124
1960    0.000474
1961    0.000124
1962    0.000082
1963    0.000165
1964    0.000247
1965    0.000350
1966    0.000453
1967    0.000535
1968    0.000535
1969    0.000391
1970    0.000782
1971    0.000535
1972    0.000680
1973    0.000474
1974    0.000494
1975    0.000371
1976    0.000432
1977    0.000453
1978    0.000906
1979    0.000700
Name: registration_year, dtype: float64

In [57]:
(autos['registration_year']
         .value_counts(normalize=True, dropna=False)
         .sort_index(ascending=False)
         .head(45)
         )

9999    0.000062
9000    0.000021
8888    0.000021
6200    0.000021
5911    0.000021
5000    0.000082
4800    0.000021
4500    0.000021
4100    0.000021
2800    0.000021
2019    0.000041
2018    0.009678
2017    0.028663
2016    0.025121
2015    0.008072
2014    0.013652
2013    0.016535
2012    0.026974
2011    0.033419
2010    0.032719
2009    0.042932
2008    0.045609
2007    0.046886
2006    0.054978
2005    0.060455
2004    0.055657
2003    0.055575
2002    0.051189
2001    0.054278
2000    0.064985
1999    0.059652
1998    0.048656
1997    0.040173
1996    0.028271
1995    0.025265
1994    0.012952
1993    0.008751
1992    0.007619
1991    0.006980
1990    0.007145
1989    0.003583
1988    0.002780
1987    0.001483
1986    0.001483
1985    0.001956
Name: registration_year, dtype: float64

In [58]:
(autos['registration_year']
         .value_counts(normalize=True, dropna=False)
         .sort_values(ascending=False)
         .head(45)
         )

2000    0.064985
2005    0.060455
1999    0.059652
2004    0.055657
2003    0.055575
2006    0.054978
2001    0.054278
2002    0.051189
1998    0.048656
2007    0.046886
2008    0.045609
2009    0.042932
1997    0.040173
2011    0.033419
2010    0.032719
2017    0.028663
1996    0.028271
2012    0.026974
1995    0.025265
2016    0.025121
2013    0.016535
2014    0.013652
1994    0.012952
2018    0.009678
1993    0.008751
2015    0.008072
1992    0.007619
1990    0.007145
1991    0.006980
1989    0.003583
1988    0.002780
1985    0.001956
1980    0.001750
1986    0.001483
1987    0.001483
1983    0.001050
1984    0.001050
1978    0.000906
1982    0.000844
1970    0.000782
1979    0.000700
1972    0.000680
1981    0.000577
1971    0.000535
1967    0.000535
Name: registration_year, dtype: float64

In [59]:
autos['registration_year'].describe()

count    48565.000000
mean      2004.755421
std         88.643887
min       1000.000000
25%       1999.000000
50%       2004.000000
75%       2008.000000
max       9999.000000
Name: registration_year, dtype: float64

The year that the car was first registered will likely indicate the age of the car. Looking at this column, we note some odd values. The minimum value is `1000`, long before cars were invented and the maximum is `9999`, many years into the future.

## Learn

One thing that stands out from the exploration we did in the last screen is that the registration_year column contains some odd values:

- The minimum value is 1000, before cars were invented
- The maximum value is 9999, many years into the future

Because a car can't be first registered after the listing was seen, any vehicle with a registration year above 2016 is definitely inaccurate. Determining the earliest valid year is more difficult. Realistically, it could be somewhere in the first few decades of the 1900s.

Let's count the number of listings with cars that fall outside the 1900 - 2016 interval and see if it's safe to remove those rows entirely, or if we need more custom logic.


- Decide which the highest and lowest acceptable values are for the registration_year column.
   - Write a markdown cell explaining your decision and why.
- Remove the values outside those upper and lower bounds and calculate the distribution of the remaining values using Series.value_counts(normalize=True).
  - Write a markdown cell explaining your observations.

### Highest and lowest acceptable values:

In [60]:
# use the ~ character to apply a not operation to the boolean map returned by the between function
bool_outside_1900_to_2016 = ~autos['registration_year'].between(1900, 2016)
bool_outside_1900_to_2016.sum() / autos.shape[0] *100

3.8793369710697

Given that this is less than 4% of our data, we will remove these rows.

### Remove the values outside those upper and lower bounds and calculate the distribution of the remaining values using Series.value_counts(normalize=True).

In [61]:
autos.shape

(48565, 17)

In [62]:
# Many ways to select rows in a dataframe that fall within a value range for a column.
# Using `Series.between()` is one way.
autos = autos[autos['registration_year'].between(1900, 2016)]

In [63]:
autos.shape

(46681, 17)

### Calculate the distribution of the remaining `registration_year` values using Series.value_counts(normalize=True).

In [64]:
autos['registration_year'].value_counts()

2000    3156
2005    2936
1999    2897
2004    2703
2003    2699
        ...
1929       1
1931       1
1938       1
1939       1
1952       1
Name: registration_year, Length: 78, dtype: int64

In [65]:
autos['registration_year'].value_counts(normalize=True).head(10)

2000    0.067608
2005    0.062895
1999    0.062060
2004    0.057904
2003    0.057818
2006    0.057197
2001    0.056468
2002    0.053255
1998    0.050620
2007    0.048778
Name: registration_year, dtype: float64

It appears that most of the vehicles were first registered in the past 20 years.

## Learn:

One of the analysis techniques we learned in this course is aggregation. When working with data on cars, it's natural to explore variations across different car brands. We can use aggregation to understand the brand column.

If you recall in an earlier lesson, we explored how to use loops to perform aggregation. Here's what the process looks like:

- Identify the unique values we want to aggregate by
- Create an empty dictionary to store our aggregate data
- Loop over the unique values, and for each: - Subset the dataframe by the unique values - Calculate the mean of whichever column we're interested in - Assign the val/mean to the dict as k/v.

## Exercise:

- Explore the unique values in the `brand` column, and decide on which brands you want to aggregate by.
  - You might want to select the top 20, or you might want to select those that have over a certain percentage of the total values (e.g. > 5%).
  - Remember that `Series.value_counts()` produces a series with index labels, so you can use Series.index attribute to access the labels, should you wish.
- Write a short paragraph describing the `brand` data, and explaining which brands you've chosen to aggregate on.
- Create an empty dictionary to hold your aggregate data.
  - Loop over your selected brands, and assign the mean price to the dictionary, with the brand name as the key.
  - Print your dictionary of aggregate data, and write a paragraph analyzing the results.

### Explore the unique values in the `brand` column, and decide on which brands you want to aggregate by.

In [66]:
autos['brand'].value_counts(normalize=True)

volkswagen        0.211264
bmw               0.110045
opel              0.107581
mercedes_benz     0.096463
audi              0.086566
ford              0.069900
renault           0.047150
peugeot           0.029841
fiat              0.025642
seat              0.018273
skoda             0.016409
nissan            0.015274
mazda             0.015188
smart             0.014160
citroen           0.014010
toyota            0.012703
hyundai           0.010025
sonstige_autos    0.009811
volvo             0.009147
mini              0.008762
mitsubishi        0.008226
honda             0.007840
kia               0.007069
alfa_romeo        0.006641
porsche           0.006127
suzuki            0.005934
chevrolet         0.005698
chrysler          0.003513
dacia             0.002635
daihatsu          0.002506
jeep              0.002271
subaru            0.002142
land_rover        0.002099
saab              0.001649
jaguar            0.001564
daewoo            0.001500
trabant           0.001392
rover             0.001328
lancia            0.001071
lada              0.000578
Name: brand, dtype: float64

German manufacturers represent four out of the top five brands, almost 50% of the overall listings. Volkswagen is by far the most popular brand, with approximately double the cars for sale of the next two brands combined.

There are lots of brands that don't have a significant percentage of listings, so we will limit our analysis to brands representing more than 5% of total listings.

### Select brand names representing more than 5% of total listings:

In [67]:
brand_counts = autos['brand'].value_counts(normalize=True)
common_brands = brand_counts[brand_counts > 0.05].index
common_brands

Index(['volkswagen', 'bmw', 'opel', 'mercedes_benz', 'audi', 'ford'], dtype='object')

### Aggregate the mean prices for each brand

In [68]:
autos.columns

Index(['date_crawled', 'name', 'price', 'abtest', 'vehicle_type',
       'registration_year', 'gearbox', 'power_ps', 'model', 'odometer_km',
       'registration_month', 'fuel_type', 'brand', 'unrepaired_damage',
       'ad_created', 'postal_code', 'last_seen'],
      dtype='object')

In [69]:
mean_prices_by_brand = {}

for brand in common_brands:
    mean_price = autos.loc[autos['brand'] == brand, 'price'].mean()
    mean_prices_by_brand[brand] = int(mean_price)
    
mean_prices_by_brand

{'volkswagen': 5402,
 'bmw': 8332,
 'opel': 2975,
 'mercedes_benz': 8628,
 'audi': 9336,
 'ford': 3749}

Of the top 5 brands, there is a distinct price gap:

- Audi, BMW and Mercedes Benz are more expensive
- Ford and Opel are less expensive
- Volkswagen is in between - this may explain its popularity, it may be a 'best of 'both worlds' option.

In [70]:
average_prices = pd.DataFrame(list(mean_prices_by_brand.items()), columns=["Brand", "Average Price $"])
average_prices

           Brand  Average Price $
0     volkswagen             5402
1            bmw             8332
2           opel             2975
3  mercedes_benz             8628
4           audi             9336
5           ford             3749

In [71]:
average_prices['Brand'] = average_prices['Brand'].str.title().str.replace('_', ' ')
average_prices['Average Price $'] = average_prices['Average Price $'].astype('int64')

In [72]:
average_prices

           Brand  Average Price $
0     Volkswagen             5402
1            Bmw             8332
2           Opel             2975
3  Mercedes Benz             8628
4           Audi             9336
5           Ford             3749

In the last screen, we aggregated across brands to understand mean price. We observed that in the top 6 brands, there's a distinct price gap.

- Audi, BMW and Mercedes Benz are more expensive
- Ford and Opel are less expensive
- Volkswagen is in between

For the top 6 brands, let's use aggregation to understand the average mileage for those cars and if there's any visible link with mean price. While our natural instinct may be to display both aggregated series objects and visually compare them, this has a few limitations:

- it's difficult to compare more than two aggregate series objects if we want to extend to more columns
- we can't compare more than a few rows from each series object
- we can only sort by the index (brand name) of both series objects so we can easily make visual comparisons

Instead, we can combine the data from both series objects into a single dataframe (with a shared index) and display the dataframe directly. To do this, we'll need to learn two pandas methods:

- [pandas series constructor](https://pandas.pydata.org/pandas-docs/stable/reference/api/pandas.Series.html)
- [pandas dataframe constructor](https://pandas.pydata.org/pandas-docs/stable/reference/api/pandas.DataFrame.html)

Here's an example of the series constructor that uses the `brand_mean_prices` dictionary:

In [73]:
mean_prices_by_brand_series = pd.Series(mean_prices_by_brand)
mean_prices_by_brand_series

volkswagen       5402
bmw              8332
opel             2975
mercedes_benz    8628
audi             9336
ford             3749
dtype: int64

The keys in the dictionary became the index in the series object. We can then create a single-column dataframe from this series object. We need to use the `columns` parameter when calling the dataframe constructor (which accepts an array-like object) to specify the column name (or the column name will be set to `0` by default):

In [74]:
brand_info = pd.DataFrame(mean_prices_by_brand_series, columns=['mean_mileage'])
brand_info

               mean_mileage
volkswagen             5402
bmw                    8332
opel                   2975
mercedes_benz          8628
audi                   9336
ford                   3749

- Use the loop method from the last screen to calculate the mean mileage and mean price for each of the top brands, storing the results in a dictionary.
- Convert both dictionaries to series objects, using the series constructor.
- Create a dataframe from the first series object using the dataframe constructor.
- Assign the other series as a new column in this dataframe.
- Pretty print the dataframe, and write a paragraph analyzing the aggregate data.

In [75]:
mean_mileage_by_brand = {}

for brand in common_brands:
    mean_mileage = autos.loc[autos['brand'] == brand, 'odometer_km'].mean()
    mean_mileage_by_brand[brand] = int(mean_mileage)
    
mean_mileage_by_brand

{'volkswagen': 128707,
 'bmw': 132572,
 'opel': 129310,
 'mercedes_benz': 130788,
 'audi': 129157,
 'ford': 124266}

In [76]:
mean_prices_by_brand_series = pd.Series(mean_prices_by_brand)
mean_mileage_by_brand_series = pd.Series(mean_mileage_by_brand)

In [77]:
brand_info = pd.DataFrame(mean_prices_by_brand_series, columns=['mean_price'])
brand_info['mean_mileage'] = mean_mileage_by_brand_series

In [78]:
brand_info

               mean_price  mean_mileage
volkswagen           5402        128707
bmw                  8332        132572
opel                 2975        129310
mercedes_benz        8628        130788
audi                 9336        129157
ford                 3749        124266

In [79]:
brand_info.sort_values(by=['mean_price'], ascending=False)

               mean_price  mean_mileage
audi                 9336        129157
mercedes_benz        8628        130788
bmw                  8332        132572
volkswagen           5402        128707
ford                 3749        124266
opel                 2975        129310

The range of car mileages does not vary as much as the prices do by brand, instead all falling within 10% for the top brands. There is a slight trend to the more expensive vehicles having higher mileage, with the less expensive vehicles having lower mileage.

In this guided project, we practiced applying a variety of pandas methods to explore and understand a data set on car listings. Here are some next steps for you to consider:

- Data cleaning next steps:
  - Identify categorical data that uses german words, translate them and map the values to their english counterparts
  - Convert the dates to be uniform numeric data, so `"2016-03-21"` becomes the integer `20160321`.
  - See if there are particular keywords in the name column that you can extract as new columns
- Analysis next steps:
  - Find the most common brand/model combinations
  - Split the `odometer_km` into groups, and use aggregation to see if average prices follows any patterns based on the mileage.
  - How much cheaper are cars with damage than their non-damaged counterparts?

Curious to see what other students have done on this project? [Head over to our Community](https://community.dataquest.io/tags/c/social/share/49/294) to check them out. While you are there, please remember to show some love and give your own feedback!

And of course, we welcome you to share your own project and show off your hard work. Head over to our Community to [share your finished Guided Project](https://community.dataquest.io/tags/c/social/share/49/294)!

# Data cleaning next steps:

> ## Identify categorical data that uses german words, translate them and map the values to their english counterparts

In [80]:
autos.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 46681 entries, 0 to 49999
Data columns (total 17 columns):
 #   Column              Non-Null Count  Dtype
---  ------              --------------  -----
 0   date_crawled        46681 non-null  object
 1   name                46681 non-null  object
 2   price               46681 non-null  int64
 3   abtest              46681 non-null  object
 4   vehicle_type        43977 non-null  object
 5   registration_year   46681 non-null  int64
 6   gearbox             44571 non-null  object
 7   power_ps            46681 non-null  int64
 8   model               44488 non-null  object
 9   odometer_km         46681 non-null  int64
 10  registration_month  46681 non-null  int64
 11  fuel_type           43363 non-null  object
 12  brand               46681 non-null  object
 13  unrepaired_damage   38374 non-null  object
 14  ad_created          46681 non-null  object
 15  postal_code         46681 non-null  int64
 16  last_seen           46681 non-null  object
dtypes: int64(6), object(11)
memory usage: 6.4+ MB

## Translate and map the `vehicle_type`

In [81]:
autos['vehicle_type'].unique()

array(['bus', 'limousine', 'kleinwagen', 'kombi', nan, 'coupe', 'suv',
       'cabrio', 'andere'], dtype=object)

#### FIll the `vehicle_type` NaN values with 'unknown'

In [82]:
autos['vehicle_type'] = autos['vehicle_type'].fillna('unknown')

In [83]:
autos['vehicle_type'].isnull().sum()

0

In [84]:
autos['vehicle_type'].unique()

array(['bus', 'limousine', 'kleinwagen', 'kombi', 'unknown', 'coupe',
       'suv', 'cabrio', 'andere'], dtype=object)

#### Replace the `vehicle_type` German words with the English translations

In [85]:
translation_map_vehicle_type = {'bus': 'bus', 
                                'limousine': 'limousine', 
                                'kleinwagen': 'small_car', 
                                'kombi': 'combi', 
                                'unknown': 'unknown', 
                                'coupe': 'coupe', 
                                'suv': 'suv',
                                'cabrio': 'convertible', 
                                'andere': 'other'}

In [86]:
autos['vehicle_type'] = autos['vehicle_type'].map(translation_map_vehicle_type)

In [87]:
autos['vehicle_type'].unique()

array(['bus', 'limousine', 'small_car', 'combi', 'unknown', 'coupe',
       'suv', 'convertible', 'other'], dtype=object)

## Translate and map the `gearbox`

In [88]:
autos['gearbox'].unique()

array(['manuell', 'automatik', nan], dtype=object)

#### FIll the `gearbox` NaN values with 'unknown'

In [89]:
autos['gearbox'] = autos['gearbox'].fillna('unknown')

In [90]:
autos['gearbox'].isnull().sum()

0

In [91]:
autos['gearbox'].unique()

array(['manuell', 'automatik', 'unknown'], dtype=object)

#### Replace the `gearbox` German words with the English translations

In [92]:
translation_map_gearbox = {'manuell': 'manual', 
                           'automatik': 'automatic', 
                           'unknown': 'unknown'}

autos['gearbox'] = autos['gearbox'].map(translation_map_gearbox)
autos['gearbox'].unique()

array(['manual', 'automatic', 'unknown'], dtype=object)

## Translate and map the `fuel_type`

In [93]:
autos['fuel_type'].unique()

array(['lpg', 'benzin', 'diesel', nan, 'cng', 'hybrid', 'elektro',
       'andere'], dtype=object)

#### FIll the `fuel_type` NaN values with 'unknown'

In [94]:
autos['fuel_type'] = autos['fuel_type'].fillna('unknown')

In [95]:
autos['fuel_type'].unique()

array(['lpg', 'benzin', 'diesel', 'unknown', 'cng', 'hybrid', 'elektro',
       'andere'], dtype=object)

In [96]:
translation_map_fuel_type = {'lpg': 'lpg', 
                             'benzin': 'gasoline', 
                             'diesel': 'diesel', 
                             'unknown': 'unknown', 
                             'cng': 'cng', 
                             'hybrid': 'hybrid', 
                             'elektro': 'electric', 
                             'andere': 'other'}

autos['fuel_type'] = autos['fuel_type'].map(translation_map_fuel_type)
autos['fuel_type'].unique()

array(['lpg', 'gasoline', 'diesel', 'unknown', 'cng', 'hybrid',
       'electric', 'other'], dtype=object)

## Translate and map the `unrepaired_damage`

In [97]:
autos['unrepaired_damage'].unique()

array(['nein', nan, 'ja'], dtype=object)

#### FIll the `unrepaired_damage` NaN values with 'unknown'

In [98]:
autos['unrepaired_damage'] = autos['unrepaired_damage'].fillna('unknown')
autos['unrepaired_damage'].unique()

array(['nein', 'unknown', 'ja'], dtype=object)

In [99]:
translation_map_unrepaired_damage = {'nein': 'no', 
                                     'unknown': 'unknown' , 
                                     'ja': 'yes'}
autos['unrepaired_damage'] = autos['unrepaired_damage'].map(translation_map_unrepaired_damage)
autos['unrepaired_damage'].unique()

array(['no', 'unknown', 'yes'], dtype=object)

> ## Convert the dates to be uniform numeric data, so "2016-03-21" becomes the integer 20160321.

In [100]:
autos.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 46681 entries, 0 to 49999
Data columns (total 17 columns):
 #   Column              Non-Null Count  Dtype
---  ------              --------------  -----
 0   date_crawled        46681 non-null  object
 1   name                46681 non-null  object
 2   price               46681 non-null  int64
 3   abtest              46681 non-null  object
 4   vehicle_type        46681 non-null  object
 5   registration_year   46681 non-null  int64
 6   gearbox             46681 non-null  object
 7   power_ps            46681 non-null  int64
 8   model               44488 non-null  object
 9   odometer_km         46681 non-null  int64
 10  registration_month  46681 non-null  int64
 11  fuel_type           46681 non-null  object
 12  brand               46681 non-null  object
 13  unrepaired_damage   46681 non-null  object
 14  ad_created          46681 non-null  object
 15  postal_code         46681 non-null  int64
 16  last_seen           46681 non-null  object
dtypes: int64(6), object(11)
memory usage: 6.4+ MB

In [101]:
autos[['date_crawled', 'ad_created', 'last_seen']]

              date_crawled           ad_created            last_seen
0      2016-03-26 17:47:46  2016-03-26 00:00:00  2016-04-06 06:45:54
1      2016-04-04 13:38:56  2016-04-04 00:00:00  2016-04-06 14:45:08
2      2016-03-26 18:57:24  2016-03-26 00:00:00  2016-04-06 20:15:37
3      2016-03-12 16:58:10  2016-03-12 00:00:00  2016-03-15 03:16:28
4      2016-04-01 14:38:50  2016-04-01 00:00:00  2016-04-01 14:38:50
...                    ...                  ...                  ...
49995  2016-03-27 14:38:19  2016-03-27 00:00:00  2016-04-01 13:47:40
49996  2016-03-28 10:50:25  2016-03-28 00:00:00  2016-04-02 14:18:02
49997  2016-04-02 14:44:48  2016-04-02 00:00:00  2016-04-04 11:47:27
49998  2016-03-08 19:25:42  2016-03-08 00:00:00  2016-04-05 16:45:07
49999  2016-03-14 00:42:12  2016-03-13 00:00:00  2016-04-06 21:18:48

[46681 rows x 3 columns]

Split up the date_crawled column into two columns:
- one with the date crawled as an int
- another with the time_crawled

Do the same with the ad_created and last_seen dates

In [102]:
autos['time_crawled'] = autos['date_crawled'].str.split().str[1]
autos['date_crawled'] = (autos['date_crawled']
                                 .str.split().str[0]
                                 .str.replace('-', '')
                                 .astype('int64'))

In [103]:
autos['time_ad_created'] = autos['ad_created'].str.split().str[1]
autos['ad_created'] = (autos['ad_created']
                                 .str.split().str[0]
                                 .str.replace('-', '')
                                 .astype('int64'))

In [104]:
autos['time_last_seen'] = autos['last_seen'].str.split().str[1]
autos['last_seen'] = (autos['last_seen']
                                 .str.split().str[0]
                                 .str.replace('-', '')
                                 .astype('int64'))

In [105]:
autos.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 46681 entries, 0 to 49999
Data columns (total 20 columns):
 #   Column              Non-Null Count  Dtype
---  ------              --------------  -----
 0   date_crawled        46681 non-null  int64
 1   name                46681 non-null  object
 2   price               46681 non-null  int64
 3   abtest              46681 non-null  object
 4   vehicle_type        46681 non-null  object
 5   registration_year   46681 non-null  int64
 6   gearbox             46681 non-null  object
 7   power_ps            46681 non-null  int64
 8   model               44488 non-null  object
 9   odometer_km         46681 non-null  int64
 10  registration_month  46681 non-null  int64
 11  fuel_type           46681 non-null  object
 12  brand               46681 non-null  object
 13  unrepaired_damage   46681 non-null  object
 14  ad_created          46681 non-null  int64
 15  postal_code         46681 non-null  int64
 16  last_seen           46681 non-null  int64
 17  time_crawled        46681 non-null  object
 18  time_ad_created     46681 non-null  object
 19  time_last_seen      46681 non-null  object
dtypes: int64(9), object(11)
memory usage: 7.5+ MB

> ## See if there are particular keywords in the name column that you can extract as new columns

In [118]:
autos['name'].unique()[:20]

array(['Peugeot_807_160_NAVTECH_ON_BOARD',
       'BMW_740i_4_4_Liter_HAMANN_UMBAU_Mega_Optik',
       'Volkswagen_Golf_1.6_United',
       'Smart_smart_fortwo_coupe_softouch/F1/Klima/Panorama',
       'Ford_Focus_1_6_Benzin_Tï¿½V_neu_ist_sehr_gepflegt.mit_Klimaanlage',
       'Chrysler_Grand_Voyager_2.8_CRD_Aut.Limited_Stowï¿½n_Go_Sitze_7Sitze',
       'VW_Golf_III_GT_Special_Electronic_Green_Metallic_Reserviert_!!!',
       'Golf_IV_1.9_TDI_90PS', 'Seat_Arosa',
       'Renault_Megane_Scenic_1.6e_RT_Klimaanlage',
       'Mercedes_A140_Motorschaden',
       'Smart_smart_fortwo_coupe_softouch_pure_MHD_Panoramadach__Klima_',
       'Audi_A3_1.6_tuning',
       'Renault_Clio_3__Dynamique_1.2__16_V;_viele_Verschleissteile_neu!',
       'Corvette_C3_Coupe_T_Top_Crossfire_Injection',
       'Opel_Vectra_B_Kombi', 'Volkswagen_Scirocco_2_G60',
       'Verkaufen_mein_bmw_e36_320_i_touring',
       'mazda_tribute_2.0_mit_gas_und_tuev_neu_2018',
       'Audi_A4_Avant_1.9_TDI_*6_Gang*AHK*Klimatronik*DPF*AGR*Tï¿½V*'],
      dtype=object)

In [115]:
autos['name'].str.split('_',).str[0].value_counts().head(20)

Volkswagen    4953
Opel          4136
BMW           4092
Mercedes      3837
Audi          3518
Ford          2750
VW            1891
Renault       1786
Peugeot       1202
Fiat          1012
Golf           930
Seat           749
Skoda          684
Verkaufe       638
Mazda          621
Nissan         617
Smart          575
Toyota         532
Bmw            480
Vw             430
Name: name, dtype: int64

> ## Find the most common brand/model combinations

In [126]:
brand_model = autos['brand'] + ' ' + autos['model']
# df['brand_model']
brand_model.value_counts().head(20)

volkswagen golf           3707
bmw 3er                   2615
volkswagen polo           1609
opel corsa                1592
volkswagen passat         1349
opel astra                1348
audi a4                   1231
mercedes_benz c_klasse    1136
bmw 5er                   1132
mercedes_benz e_klasse     958
audi a3                    825
audi a6                    797
ford focus                 762
ford fiesta                722
volkswagen transporter     674
renault twingo             615
peugeot 2_reihe            600
smart fortwo               550
opel vectra                544
mercedes_benz a_klasse     539
dtype: int64

In [129]:
brand_model.value_counts(normalize=True).head(20)

volkswagen golf           0.083326
bmw 3er                   0.058780
volkswagen polo           0.036167
opel corsa                0.035785
volkswagen passat         0.030323
opel astra                0.030300
audi a4                   0.027670
mercedes_benz c_klasse    0.025535
bmw 5er                   0.025445
mercedes_benz e_klasse    0.021534
audi a3                   0.018544
audi a6                   0.017915
ford focus                0.017128
ford fiesta               0.016229
volkswagen transporter    0.015150
renault twingo            0.013824
peugeot 2_reihe           0.013487
smart fortwo              0.012363
opel vectra               0.012228
mercedes_benz a_klasse    0.012116
dtype: float64

> ## Split the `odometer_km` into groups, and use aggregation to see if average prices follows any patterns based on the mileage.

> ## How much cheaper are cars with damage than their non-damaged counterparts?

In [130]:
autos['unrepaired_damage'].value_counts()

no         33834
unknown     8307
yes         4540
Name: unrepaired_damage, dtype: int64

In [137]:
av_price_undamaged = autos[autos['unrepaired_damage'] == 'no']['price'].mean()
av_price_undamaged

7164.033102796004

In [138]:
av_price_damaged = autos[autos['unrepaired_damage'] == 'yes']['price'].mean()
av_price_damaged

2241.146035242291

In [140]:
price_difference = int(av_price_undamaged - av_price_damaged)
price_difference

4922